In [1]:
import seaborn as sns

In [2]:
tips = sns.load_dataset('tips')

In [4]:
tips['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
5      25.29
6       8.77
7      26.88
8      15.04
9      14.78
10     10.27
11     35.26
12     15.42
13     18.43
14     14.83
15     21.58
16     10.33
17     16.29
18     16.97
19     20.65
20     17.92
21     20.29
22     15.77
23     39.42
24     19.82
25     17.81
26     13.37
27     12.69
28     21.70
29     19.65
       ...
214    28.17
215    12.90
216    28.15
217    11.59
218     7.74
219    30.14
220    12.16
221    13.42
222     8.58
223    15.98
224    13.42
225    16.27
226    10.09
227    20.45
228    13.28
229    22.12
230    24.01
231    15.69
232    11.61
233    10.77
234    15.53
235    10.07
236    12.60
237    32.83
238    35.83
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [7]:
type(tips['total_bill']) #Series방식 1개만 뽑고싶을때

pandas.core.series.Series

In [10]:
tips['total_bill'].sum()

4827.77

In [13]:
tips.total_bill.sum()

4827.77

In [19]:
tips[['total_bill','tip']].head(10)

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61
5       25.29  4.71
6        8.77  2.00
7       26.88  3.12
8       15.04  1.96
9       14.78  3.23

In [22]:
my_tip = tips[['total_bill','tip']].copy()

In [44]:
my_tip.head(10)

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61
5       25.29  4.71
6        8.77  2.00
7       26.88  3.12
8       15.04  1.96
9       14.78  3.23

loc는 문자
iloc는 숫자

In [35]:
my_tip.loc[0 : 5] #0부터 5까지나온다.  loc

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61
5       25.29  4.71

In [40]:
my_tip.iloc[0 : 5] #파이썬 방식으로 0부터 4까지 나온다. iloc

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61

In [39]:
my_tip.iloc[0 : 5,: 1]

   total_bill
0       16.99
1       10.34
2       21.01
3       23.68
4       24.59

In [43]:
my_tip.loc[0 : 5, : 'total_bill'] #이름 기반으로 뽑는다.

   total_bill
0       16.99
1       10.34
2       21.01
3       23.68
4       24.59
5       25.29

In [49]:
tips.at[3,'day']

'Sun'

In [53]:
tips.groupby('smoker').mean()

        total_bill       tip      size
smoker
Yes      20.756344  3.008710  2.408602
No       19.188278  2.991854  2.668874

In [55]:
x = tips.groupby('sex').mean()

In [56]:
x['ratio'] = x.tip / x.total_bill

In [57]:
x

        total_bill       tip      size     ratio
sex
Male     20.744076  3.089618  2.630573  0.148940
Female   18.056897  2.833448  2.459770  0.156918

In [60]:
tips.groupby('smoker').mean()

        total_bill       tip      size
smoker
Yes      20.756344  3.008710  2.408602
No       19.188278  2.991854  2.668874

In [61]:
y = tips.groupby('smoker').mean()

In [62]:
y['ratio'] = y.tip / y.total_bill

In [63]:
y

        total_bill       tip      size     ratio
smoker
Yes      20.756344  3.008710  2.408602  0.144954
No       19.188278  2.991854  2.668874  0.155921

In [66]:
tips.groupby(['sex','day']).mean()

             total_bill       tip      size
sex    day
Male   Thur   18.714667  2.980333  2.433333
       Fri    19.857000  2.693000  2.100000
       Sat    20.802542  3.083898  2.644068
       Sun    21.887241  3.220345  2.810345
Female Thur   16.715312  2.575625  2.468750
       Fri    14.145556  2.781111  2.111111
       Sat    19.680357  2.801786  2.250000
       Sun    19.872222  3.367222  2.944444

In [68]:
tips.groupby(['sex','day']).max()

             size    tip  total_bill
sex    day
Male   Thur     6   6.70       41.19
       Fri      4   4.73       40.17
       Sat      5  10.00       50.81
       Sun      6   6.50       48.17
Female Thur     6   5.17       43.11
       Fri      3   4.30       22.75
       Sat      4   6.50       44.30
       Sun      5   5.20       35.26

In [73]:
tips.tip = tips.tip + 1

In [75]:
tips.to_csv #저장

<bound method NDFrame.to_csv of      total_bill   tip     sex smoker   day    time  size
0         16.99  2.01  Female     No   Sun  Dinner     2
1         10.34  2.66    Male     No   Sun  Dinner     3
2         21.01  4.50    Male     No   Sun  Dinner     3
3         23.68  4.31    Male     No   Sun  Dinner     2
4         24.59  4.61  Female     No   Sun  Dinner     4
5         25.29  5.71    Male     No   Sun  Dinner     4
6          8.77  3.00    Male     No   Sun  Dinner     2
7         26.88  4.12    Male     No   Sun  Dinner     4
8         15.04  2.96    Male     No   Sun  Dinner     2
9         14.78  4.23    Male     No   Sun  Dinner     2
10        10.27  2.71    Male     No   Sun  Dinner     2
11        35.26  6.00  Female     No   Sun  Dinner     4
12        15.42  2.57    Male     No   Sun  Dinner     2
13        18.43  4.00    Male     No   Sun  Dinner     4
14        14.83  4.02  Female     No   Sun  Dinner     2
15        21.58  4.92    Male     No   Sun  Dinner     2
16        10.33  2.67  Female     No   Sun  Dinner     3
17        16.29  4.71    Male     No   Sun  Dinner     3
18        16.97  4.50  Female     No   Sun  Dinner     3
19        20.65  4.35    Male     No   Sat  Dinner     3
20        17.92  5.08    Male     No   Sat  Dinner     2
21        20.29  3.75  Female     No   Sat  Dinner     2
22        15.77  3.23  Female     No   Sat  Dinner     2
23        39.42  8.58    Male     No   Sat  Dinner     4
24        19.82  4.18    Male     No   Sat  Dinner     2
25        17.81  3.34    Male     No   Sat  Dinner     4
26        13.37  3.00    Male     No   Sat  Dinner     2
27        12.69  3.00    Male     No   Sat  Dinner     2
28        21.70  5.30    Male     No   Sat  Dinner     2
29        19.65  4.00  Female     No   Sat  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
214       28.17  7.50  Female    Yes   Sat  Dinner     3
215       12.90  2.10  Female    Yes   Sat  Dinner     2
216       28.15  4.00    Male    Yes   Sat  Dinner     5
217       11.59  2.50    Male    Yes   Sat  Dinner     2
218        7.74  2.44    Male    Yes   Sat  Dinner     2
219       30.14  4.09  Female    Yes   Sat  Dinner     4
220       12.16  3.20    Male    Yes   Fri   Lunch     2
221       13.42  4.48  Female    Yes   Fri   Lunch     2
222        8.58  2.92    Male    Yes   Fri   Lunch     1
223       15.98  4.00  Female     No   Fri   Lunch     3
224       13.42  2.58    Male    Yes   Fri   Lunch     2
225       16.27  3.50  Female    Yes   Fri   Lunch     2
226       10.09  3.00  Female    Yes   Fri   Lunch     2
227       20.45  4.00    Male     No   Sat  Dinner     4
228       13.28  3.72    Male     No   Sat  Dinner     2
229       22.12  3.88  Female    Yes   Sat  Dinner     2
230       24.01  3.00    Male    Yes   Sat  Dinner     4
231       15.69  4.00    Male    Yes   Sat  Dinner     3
232       11.61  4.39    Male     No   Sat  Dinner     2
233       10.77  2.47    Male     No   Sat  Dinner     2
234       15.53  4.00    Male    Yes   Sat  Dinner     2
235       10.07  2.25    Male     No   Sat  Dinner     2
236       12.60  2.00    Male    Yes   Sat  Dinner     2
237       32.83  2.17    Male    Yes   Sat  Dinner     2
238       35.83  5.67  Female     No   Sat  Dinner     3
239       29.03  6.92    Male     No   Sat  Dinner     3
240       27.18  3.00  Female    Yes   Sat  Dinner     2
241       22.67  3.00    Male    Yes   Sat  Dinner     2
242       17.82  2.75    Male     No   Sat  Dinner     2
243       18.78  4.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>